Revit 2027 API
FabricationConnectorInfo.HasDoubleWallConnector Method
 Checks if there are any double wall connectors fabricated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasDoubleWallConnector()
Public Function HasDoubleWallConnector As Boolean
public:
bool HasDoubleWallConnector()
member HasDoubleWallConnector : unit -> bool
Return Value
Boolean
 True if there are any double wall connectors fabricated.
See Also
Reference
FabricationConnectorInfo Class
Autodesk.Revit.DB Namespace